mwestbom.org
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t html5-fancy:t
#+OPTIONS: tex:t
#+HTML_DOCTYPE: html5
#+HTML_CONTAINER: div
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_HEAD: <link href="http://cdn.foundation5.zurb.com/foundation.css" rel="stylesheet">
#+HTML_HEAD_EXTRA:
#+HTML_MATHJAX:
#+INFOJS_OPT:
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.3beta)
#+LATEX_HEADER:
#+TITLE: Michael Westbom's Emacs configuration
#+OPTIONS: toc:4 h:4
#+HTML_HEAD: <link href="http://cdn.foundation5.zurb.com/foundation.css" rel="stylesheet">

* Configuration
** About this file
   This is my configuration file.  It can be loaded by Emacs via org-babel.
   The contents of my =~/.emacs/init.el= simplify to this, which loads it:
   #+BEGIN_SRC emacs-lisp :tangle no
     (add-hook 'after-init-hook
               (lambda ()
                 (org-babel-load-file
                  (expand-file-name "mwestbom.org" user-emacs-directory))))
   #+END_SRC
   One can evaluate individual blocks of this file by putting =(point)= on them
   and calling =org-edit-special=, which is bound by default to =C-c \'=

   Then =M-x eval-buffer= to evaluate them.
** Package management
*** Sources
*** use-package
    Now we'll enable John Wiegley's phenomenal [[https://github.com/jwiegley/use-package][use-package]] library:

    #+begin_src emacs-lisp
      (unless (package-installed-p 'use-package)
        (package-refresh-contents)
        (package-install 'use-package))

      (require 'use-package)
    #+end_src

** General configuration
*** Customize
    Going to move away from customize eventually, but
    until then, let's use the customizations I've got:

    #+begin_src emacs-lisp
      (setq custom-file
            (expand-file-name "customizations.el" user-emacs-directory))
      (load custom-file)
    #+end_src
*** Apple keyboards
    Swap super and meta for macs.  This retains option being alt as in the rest of the OS.
    #+BEGIN_SRC emacs-lisp
      (setq mac-command-modifier 'super
            mac-option-modifier 'meta)
    #+END_SRC
*** No blinking.
    Seriously.
    #+begin_src emacs-lisp
    (blink-cursor-mode 0)
    #+end_src
*** Display
**** Toolbar
     Emacs comes with a toolbar.  It's redundant.
     #+BEGIN_SRC emacs-lisp
       (tool-bar-mode -1)
     #+END_SRC
*** Buffers
**** Uniquify
     By default, files with the same name but in different folders
     aren't well distinguished.  Uniquify, built into Emacs, solves this.
***** Name style
      By default, Uniquify names buffers like this:
      - post.js<1>
      - post.js<2>

      Let's name them like this:
      - app/models/post.js
      - app/controllers/post.js

     #+BEGIN_SRC emacs-lisp
       (setq uniquify-buffer-name-style 'forward)
     #+END_SRC
*** Help and discoverability.

Let's enable guide-key.  This tells you what possible bindings
are available based on what you've already pressed.

#+Begin_src emacs-lisp
  (use-package guide-key-tip
    :ensure t
    :diminish guide-key-mode
    :init
    (progn
      (setq guide-key/guide-key-sequence `("C-x"
                                           "C-c"
                                           "C-h")
            guide-key/recursive-key-sequence-flag t
            guide-key/text-scale-amount 0
            guide-key-tip/enabled nil)
      (guide-key-mode 1)))
#+end_src

*** Whitespace
