mwestbom.html
<!DOCTYPE html>
<html>
<head>
<title>Michael Westbom's Emacs configuration</title>
<!-- 2015-02-02 Mon 09:47 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Michael Westbom">
<link href="http://cdn.foundation5.zurb.com/foundation.css" rel="stylesheet">
<link href="http://cdn.foundation5.zurb.com/foundation.css" rel="stylesheet">
</head>
<body>
<div id="content">
<h1 class="title">Michael Westbom's Emacs configuration</h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">Configuration</a>
<ul>
<li><a href="#unnumbered-2">About this file</a></li>
<li><a href="#unnumbered-3">Package management</a>
<ul>
<li><a href="#unnumbered-4">Sources</a></li>
<li><a href="#unnumbered-5">use-package</a></li>
</ul>
</li>
<li><a href="#unnumbered-6">General configuration</a>
<ul>
<li><a href="#unnumbered-7">Customize</a></li>
<li><a href="#unnumbered-8">Apple keyboards</a></li>
<li><a href="#unnumbered-9">No blinking.</a></li>
<li><a href="#unnumbered-10">Display</a>
<ul>
<li><a href="#unnumbered-11">Toolbar</a></li>
</ul>
</li>
<li><a href="#unnumbered-12">Buffers</a>
<ul>
<li><a href="#unnumbered-13">Uniquify</a></li>
</ul>
</li>
<li><a href="#unnumbered-15">Help and discoverability.</a></li>
<li><a href="#unnumbered-16">Whitespace</a>
<ul>
<li><a href="#unnumbered-17">Clean up trailing whitespace stuff in terminals</a></li>
</ul>
</li>
<li><a href="#unnumbered-18">Line numbers</a>
<ul>
<li><a href="#unnumbered-19">Modeline</a></li>
<li><a href="#unnumbered-20">Selectively enable linum-mode</a></li>
</ul>
</li>
<li><a href="#unnumbered-21">Change "yes or no" to "y or n"</a></li>
<li><a href="#unnumbered-22">Color scheme</a></li>
<li><a href="#unnumbered-23">Helm</a>
<ul>
<li><a href="#unnumbered-24">Disable ido-mode</a></li>
<li><a href="#unnumbered-25">helm-descbinds</a></li>
</ul>
</li>
<li><a href="#unnumbered-26">Backups</a></li>
<li><a href="#unnumbered-27">Modeline</a></li>
<li><a href="#unnumbered-28">Undo Tree</a></li>
<li><a href="#unnumbered-29">Window management</a>
<ul>
<li><a href="#unnumbered-30">Window splitting</a></li>
<li><a href="#unnumbered-31">Winner mode</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#unnumbered-32">Navigation</a>
<ul>
<li><a href="#unnumbered-33">The Silver Searcher</a></li>
<li><a href="#unnumbered-34">Windmove</a></li>
<li><a href="#unnumbered-35">Beginning of line</a></li>
<li><a href="#unnumbered-36">Visual expand</a></li>
<li><a href="#unnumbered-37">Pop to mark</a></li>
<li><a href="#unnumbered-38">Switch to previous buffer</a></li>
<li><a href="#unnumbered-39">Projectile</a></li>
</ul>
</li>
<li><a href="#unnumbered-40">Org</a>
<ul>
<li><a href="#unnumbered-41">Speed keys</a></li>
<li><a href="#unnumbered-42">Publishing</a>
<ul>
<li><a href="#unnumbered-43">Section numbers</a></li>
<li><a href="#unnumbered-44">Stylesheets</a></li>
<li><a href="#unnumbered-45">Publish config file</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#unnumbered-46">Programming</a>
<ul>
<li><a href="#unnumbered-47">Git</a>
<ul>
<li><a href="#unnumbered-48">Magit</a></li>
<li><a href="#unnumbered-49">Gist</a></li>
<li><a href="#unnumbered-50">git-timemachine</a></li>
<li><a href="#unnumbered-51">git-messenger</a></li>
</ul>
</li>
<li><a href="#unnumbered-52">Rainbows!</a>
<ul>
<li><a href="#unnumbered-53">Rainbow identifiers</a></li>
<li><a href="#unnumbered-54">Rainbow Delimiters</a></li>
</ul>
</li>
<li><a href="#unnumbered-55">Autocomplete</a></li>
<li><a href="#unnumbered-56">Flycheck</a></li>
<li><a href="#unnumbered-57">Smartparens</a></li>
<li><a href="#unnumbered-58">Web mode</a></li>
<li><a href="#unnumbered-59">Clojure</a>
<ul>
<li><a href="#unnumbered-60">Clojure mode</a></li>
<li><a href="#unnumbered-61">Cider</a></li>
</ul>
</li>
<li><a href="#unnumbered-62">Various language modes</a>
<ul>
<li><a href="#unnumbered-63">Ruby</a></li>
<li><a href="#unnumbered-67">Markdown</a></li>
<li><a href="#unnumbered-68">Docker</a></li>
<li><a href="#unnumbered-69">Javascript</a></li>
<li><a href="#unnumbered-70">CSS</a></li>
<li><a href="#unnumbered-72">Yaml</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#unnumbered-73">Terminals and shells</a>
<ul>
<li>
<ul>
<li><a href="#unnumbered-74">Multi term</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Configuration</h2>
<div class="outline-text-2" id="text-unnumbered-1">
</div><div id="outline-container-unnumbered-2" class="outline-3">
<h3 id="unnumbered-2">About this file</h3>
<div class="outline-text-3" id="text-unnumbered-2">
<p>
This is my configuration file.  It can be loaded by Emacs via org-babel.
The contents of my <code>~/.emacs/init.el</code> simplify to this, which loads it:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook 'after-init-hook
          <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span>
            <span class="org-rainbow-delimiters-depth-3">(</span>org-babel-load-file
             <span class="org-rainbow-delimiters-depth-4">(</span>expand-file-name <span class="org-string">"mwestbom.org"</span> user-emacs-directory<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
<p>
One can evaluate individual blocks of this file by putting <code>(point)</code> on them
and calling <code>org-edit-special</code>, which is bound by default to =C-c \'=
</p>

<p>
Then <code>M-x eval-buffer</code> to evaluate them.
</p>
</div>
</div>
<div id="outline-container-unnumbered-3" class="outline-3">
<h3 id="unnumbered-3">Package management</h3>
<div class="outline-text-3" id="text-unnumbered-3">
</div><div id="outline-container-unnumbered-4" class="outline-4">
<h4 id="unnumbered-4">Sources</h4>
</div>
<div id="outline-container-unnumbered-5" class="outline-4">
<h4 id="unnumbered-5">use-package</h4>
<div class="outline-text-4" id="text-unnumbered-5">
<p>
Now we'll enable John Wiegley's phenomenal <a href="https://github.com/jwiegley/use-package">use-package</a> library:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">unless</span> <span class="org-rainbow-delimiters-depth-2">(</span>package-installed-p 'use-package<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>package-refresh-contents<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>package-install 'use-package<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> '<span class="org-constant">use-package</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-unnumbered-6" class="outline-3">
<h3 id="unnumbered-6">General configuration</h3>
<div class="outline-text-3" id="text-unnumbered-6">
</div><div id="outline-container-unnumbered-7" class="outline-4">
<h4 id="unnumbered-7">Customize</h4>
<div class="outline-text-4" id="text-unnumbered-7">
<p>
Going to move away from customize eventually, but
until then, let's use the customizations I've got:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq custom-file
      <span class="org-rainbow-delimiters-depth-2">(</span>expand-file-name <span class="org-string">"customizations.el"</span> user-emacs-directory<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>load custom-file<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-8" class="outline-4">
<h4 id="unnumbered-8">Apple keyboards</h4>
<div class="outline-text-4" id="text-unnumbered-8">
<p>
Swap super and meta for macs.  This retains option being alt as in the rest of the OS.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq mac-command-modifier 'super
      mac-option-modifier 'meta<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-9" class="outline-4">
<h4 id="unnumbered-9">No blinking.</h4>
<div class="outline-text-4" id="text-unnumbered-9">
<p>
Seriously.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>blink-cursor-mode 0<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-10" class="outline-4">
<h4 id="unnumbered-10">Display</h4>
<div class="outline-text-4" id="text-unnumbered-10">
</div><div id="outline-container-unnumbered-11" class="outline-5">
<h5 id="unnumbered-11">Toolbar</h5>
<div class="outline-text-5" id="text-unnumbered-11">
<p>
Emacs comes with a toolbar.  It's redundant.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>tool-bar-mode -1<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-unnumbered-12" class="outline-4">
<h4 id="unnumbered-12">Buffers</h4>
<div class="outline-text-4" id="text-unnumbered-12">
</div><div id="outline-container-unnumbered-13" class="outline-5">
<h5 id="unnumbered-13">Uniquify</h5>
<div class="outline-text-5" id="text-unnumbered-13">
<p>
By default, files with the same name but in different folders
aren't well distinguished.  Uniquify, built into Emacs, solves this.
</p>
</div>
<ul class="org-ul"><li><a id="unnumbered-14"></a>Name style<br ><div class="outline-text-6" id="text-unnumbered-14">
<p>
By default, Uniquify names buffers like this:
</p>
<ul class="org-ul">
<li>post.js&lt;1&gt;
</li>
<li>post.js&lt;2&gt;
</li>
</ul>

<p>
Let's name them like this:
</p>
<ul class="org-ul">
<li>app/models/post.js
</li>
<li>app/controllers/post.js
</li>
</ul>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq uniquify-buffer-name-style 'forward<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li></ul>
</div>
</div>
<div id="outline-container-unnumbered-15" class="outline-4">
<h4 id="unnumbered-15">Help and discoverability.</h4>
<div class="outline-text-4" id="text-unnumbered-15">
<p>
Let's enable guide-key.  This tells you what possible bindings
are available based on what you've already pressed.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">guide-key-tip</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span> guide-key-mode
  <span class="org-builtin">:init</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>setq guide-key/guide-key-sequence `<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-string">"C-x"</span>
                                         <span class="org-string">"C-c"</span>
                                         <span class="org-string">"C-h"</span><span class="org-rainbow-delimiters-depth-4">)</span>
          guide-key/recursive-key-sequence-flag t
          guide-key/text-scale-amount 0
          guide-key-tip/enabled nil<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>guide-key-mode 1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
