mwestbom.org
**** Clean up trailing whitespace stuff in terminals
     #+BEGIN_SRC emacs-lisp
       (add-hook 'term-mode-hook
                 (lambda ()
                   (setq show-trailing-whitespace nil)))

       (add-hook 'eshell-mode-hook
                 (lambda ()
                   (setq show-trailing-whitespace nil)))
     #+END_SRC
*** Line numbers
**** Modeline
    #+begin_src emacs-lisp
    ;; Add line/column numbers to modeline
    (line-number-mode t)
    (column-number-mode t)
    #+end_src

**** Selectively enable linum-mode
     =linum-mode= enables gutter line numbers. Disable it for specific modes.

     From [[http://emacswiki.org/emacs/linum-off.el][emacswiki]]
     #+begin_src emacs-lisp
       (require 'linum)

       (defcustom linum-disabled-modes-list '(eshell-mode
                                              wl-summary-mode
                                              compilation-mode
                                              org-mode
                                              text-mode
                                              dired-mode
                                              doc-view-mode
                                              image-mode)
         "* List of modes disabled when global linum mode is on"
         :type '(repeat (sexp :tag "Major mode"))
         :tag " Major modes where linum is disabled"
         :group 'linum)

       (defcustom linum-disable-starred-buffers 't
         "* Disable buffers that have stars in them like *Gnu Emacs*"
         :type 'boolean
         :group 'linum)

       (defun linum-on ()
         "* When linum is running globally, disable line numbers in modes
       defined in `linum-disabled-modes-list'. Changed by linum-off.
       Also turns off numbering in starred modes like *scratch*."
         (unless (or (minibufferp)
                     (member major-mode linum-disabled-modes-list)
                     (string-match "*" (buffer-name))
                     (> (buffer-size) 3000000)) ;; Don't number huge files
           (linum-mode 1)))
       (provide 'linum-off)
     #+end_src

*** Change "yes or no" to "y or n"
    y is just fine, thank you.

    #+begin_src emacs-lisp
    (fset 'yes-or-no-p 'y-or-n-p)
    #+end_src
*** Color scheme

    Zenburn. Set it.  If it's not there, download it.

#+begin_src emacs-lisp
  (defun mcw/load-theme ()
    (if (package-installed-p 'zenburn-theme)
        (load-theme 'zenburn)
      (progn
        (package-install 'zenburn-theme)
        (mcw/load-theme))))

  (mcw/load-theme)
#+end_src

*** Helm
    Helm is, in my opinion, the best minibuffer completion thing.
    Let's stick it just about everywhere.

    Also replace the standard =M-x= with =helm-M-x=

    Still further, we'll replace =C-x b= (switch-to-buffer) with
    helm-mini, which is crazy smart

    #+begin_src emacs-lisp
      (use-package helm
        :ensure t
        :diminish helm-mode
        :init
        (progn
          (require 'helm-config)
          (global-set-key (kbd "M-x") 'helm-M-x)
          (global-set-key (kbd "M-y") 'helm-show-kill-ring)
          (global-set-key (kbd "C-x b") 'helm-mini)
          (helm-mode)))
    #+end_src

**** Disable ido-mode
    Don't need ido-mode.  Disable it.

    #+begin_src emacs-lisp
    (ido-mode -1)
    #+end_src

**** helm-descbinds
    helm-descbinds is pretty great.  =C-h b= brings up a helm-powered
    list of available bindings in the current mode.
    #+begin_src emacs-lisp
    (use-package helm-descbinds
    :ensure helm-descbinds
    :config
      (helm-descbinds-mode))
    #+end_src
