mwestbom.html

<div id="outline-container-unnumbered-16" class="outline-4">
<h4 id="unnumbered-16">Whitespace</h4>
<div class="outline-text-4" id="text-unnumbered-16">
</div><div id="outline-container-unnumbered-17" class="outline-5">
<h5 id="unnumbered-17">Clean up trailing whitespace stuff in terminals</h5>
<div class="outline-text-5" id="text-unnumbered-17">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook 'term-mode-hook
          <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span>
            <span class="org-rainbow-delimiters-depth-3">(</span>setq show-trailing-whitespace nil<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>add-hook 'eshell-mode-hook
          <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span>
            <span class="org-rainbow-delimiters-depth-3">(</span>setq show-trailing-whitespace nil<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-unnumbered-18" class="outline-4">
<h4 id="unnumbered-18">Line numbers</h4>
<div class="outline-text-4" id="text-unnumbered-18">
</div><div id="outline-container-unnumbered-19" class="outline-5">
<h5 id="unnumbered-19">Modeline</h5>
<div class="outline-text-5" id="text-unnumbered-19">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Add line/column numbers to modeline</span>
<span class="org-rainbow-delimiters-depth-1">(</span>line-number-mode t<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>column-number-mode t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-20" class="outline-5">
<h5 id="unnumbered-20">Selectively enable linum-mode</h5>
<div class="outline-text-5" id="text-unnumbered-20">
<p>
<code>linum-mode</code> enables gutter line numbers. Disable it for specific modes.
</p>

<p>
From <a href="http://emacswiki.org/emacs/linum-off.el">emacswiki</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> '<span class="org-constant">linum</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defcustom</span> <span class="org-variable-name">linum-disabled-modes-list</span> '<span class="org-rainbow-delimiters-depth-2">(</span>eshell-mode
                                       wl-summary-mode
                                       compilation-mode
                                       org-mode
                                       text-mode
                                       dired-mode
                                       doc-view-mode
                                       image-mode<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"* List of modes disabled when global linum mode is on"</span>
  <span class="org-builtin">:type</span> '<span class="org-rainbow-delimiters-depth-2">(</span>repeat <span class="org-rainbow-delimiters-depth-3">(</span>sexp <span class="org-builtin">:tag</span> <span class="org-string">"Major mode"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:tag</span> <span class="org-string">" Major modes where linum is disabled"</span>
  <span class="org-builtin">:group</span> 'linum<span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defcustom</span> <span class="org-variable-name">linum-disable-starred-buffers</span> 't
  <span class="org-doc">"* Disable buffers that have stars in them like *Gnu Emacs*"</span>
  <span class="org-builtin">:type</span> 'boolean
  <span class="org-builtin">:group</span> 'linum<span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">linum-on</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"* When linum is running globally, disable line numbers in modes</span>
<span class="org-doc">defined in `</span><span class="org-doc"><span class="org-constant">linum-disabled-modes-list</span></span><span class="org-doc">'. Changed by linum-off.</span>
<span class="org-doc">Also turns off numbering in starred modes like *scratch*."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">unless</span> <span class="org-rainbow-delimiters-depth-3">(</span>or <span class="org-rainbow-delimiters-depth-4">(</span>minibufferp<span class="org-rainbow-delimiters-depth-4">)</span>
              <span class="org-rainbow-delimiters-depth-4">(</span>member major-mode linum-disabled-modes-list<span class="org-rainbow-delimiters-depth-4">)</span>
              <span class="org-rainbow-delimiters-depth-4">(</span>string-match <span class="org-string">"*"</span> <span class="org-rainbow-delimiters-depth-5">(</span>buffer-name<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
              <span class="org-rainbow-delimiters-depth-4">(</span>&gt; <span class="org-rainbow-delimiters-depth-5">(</span>buffer-size<span class="org-rainbow-delimiters-depth-5">)</span> 3000000<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">Don't number huge files</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>linum-mode 1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">provide</span> '<span class="org-constant">linum-off</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-unnumbered-21" class="outline-4">
<h4 id="unnumbered-21">Change "yes or no" to "y or n"</h4>
<div class="outline-text-4" id="text-unnumbered-21">
<p>
y is just fine, thank you.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>fset 'yes-or-no-p 'y-or-n-p<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-22" class="outline-4">
<h4 id="unnumbered-22">Color scheme</h4>
<div class="outline-text-4" id="text-unnumbered-22">
<p>
Zenburn. Set it.  If it's not there, download it.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">mcw/load-theme</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-3">(</span>package-installed-p 'zenburn-theme<span class="org-rainbow-delimiters-depth-3">)</span>
      <span class="org-rainbow-delimiters-depth-3">(</span>load-theme 'zenburn<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">progn</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>package-install 'zenburn-theme<span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>mcw/load-theme<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>mcw/load-theme<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-23" class="outline-4">
<h4 id="unnumbered-23">Helm</h4>
<div class="outline-text-4" id="text-unnumbered-23">
<p>
Helm is, in my opinion, the best minibuffer completion thing.
Let's stick it just about everywhere.
</p>

<p>
Also replace the standard <code>M-x</code> with <code>helm-M-x</code>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">helm</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span> helm-mode
  <span class="org-builtin">:init</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">require</span> '<span class="org-constant">helm-config</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>global-set-key <span class="org-rainbow-delimiters-depth-4">(</span>kbd <span class="org-string">"M-x"</span><span class="org-rainbow-delimiters-depth-4">)</span> 'helm-M-x<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>global-set-key <span class="org-rainbow-delimiters-depth-4">(</span>kbd <span class="org-string">"M-y"</span><span class="org-rainbow-delimiters-depth-4">)</span> 'helm-show-kill-ring<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>helm-mode<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>

<div id="outline-container-unnumbered-24" class="outline-5">
<h5 id="unnumbered-24">Disable ido-mode</h5>
<div class="outline-text-5" id="text-unnumbered-24">
<p>
Don't need ido-mode.  Disable it.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>ido-mode -1<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-25" class="outline-5">
<h5 id="unnumbered-25">helm-descbinds</h5>
<div class="outline-text-5" id="text-unnumbered-25">
<p>
helm-descbinds is pretty great.  <code>C-h b</code> brings up a helm-powered
list of available bindings in the current mode.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">helm-descbinds</span>
<span class="org-builtin">:ensure</span> helm-descbinds
<span class="org-builtin">:config</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>helm-descbinds-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
