mwestbom.org
*** Backups

Turn on a whole mess of backup/save stuff. I'll probably cut
this out eventually.

#+begin_src emacs-lisp
  (setq
   backup-by-copying t
   backup-directory-alist '(("." . "~/.emacs.d/saves"))
   delete-old-versions -1
   version-control t)

  (let
      ((autosave-dir (expand-file-name "autosave" user-emacs-directory)))
    (unless (file-exists-p autosave-dir)
      (make-directory autosave-dir))
    (setq auto-save-list-file-prefix (concat autosave-dir "/")
          auto-save-file-name-transforms `((".*" ,autosave-dir t))))

  (setq gc-cons-threshold 200000000)
#+end_src

*** Modeline
    The default modeline can get unwieldy, and go wider than the frame.

    Add Bruce Connor's [[https://github.com/Bruce-Connor/smart-mode-line][smart-mode-line]] to make for a prettier and more
    manageable modeline

    #+begin_src emacs-lisp
      (use-package smart-mode-line
        :ensure smart-mode-line
        :pre-init
        :init
        (progn
          (use-package smart-mode-line-powerline-theme
            :ensure smart-mode-line-powerline-theme))
        :config
        (progn
          (setq-default mode-line-format
                        '("%e"
                          mode-line-front-space
                          mode-line-mule-info
                          mode-line-client
                          mode-line-modified
                          mode-line-remote
                          mode-line-frame-identification
                          mode-line-buffer-identification
                          sml/pos-id-separator
                          mode-line-position
                          (vc-mode vc-mode)
                          sml/pre-modes-separator
                          mode-line-modes
                          mode-line-misc-info
                          mode-line-end-spaces))
          (sml/setup)))
    #+end_src

*** Undo Tree
    Undo tree is fabulous
    #+begin_src emacs-lisp
      (use-package undo-tree
        :ensure undo-tree
        :diminish undo-tree-mode
        :init
        (progn
          (global-undo-tree-mode)))
    #+end_src
*** Window management
**** Window splitting
     Stole these from
     [[http://pages.sachachua.com/.emacs.d/Sacha.html#unnumbered-28][Sacha Chua]]
    #+begin_src emacs-lisp
      (defun vsplit-last-buffer ()
        (interactive)
        (split-window-vertically)
        (other-window 1 nil)
        (switch-to-next-buffer))

      (defun hsplit-last-buffer ()
        (interactive)
        (split-window-horizontally)
        (other-window 1 nil)
        (switch-to-next-buffer))

      (global-set-key (kbd "C-x 2") 'vsplit-last-buffer)
      (global-set-key (kbd "C-x 3") 'hsplit-last-buffer)
    #+end_src

**** Winner mode
     Winner mode adds an undo history to window configurations.
     #+begin_src emacs-lisp
       (use-package winner
         :ensure winner
         :init (winner-mode 1))
     #+end_src
** Navigation
*** The Silver Searcher
    Enable integration with Ag.  This must happen before [[Projectile]]
    #+BEGIN_SRC emacs-lisp
      (use-package helm-ag
        :ensure helm-ag)
    #+END_SRC
*** Windmove
     Windmove beats using =C-x o= to toggle through windows

     Let's switch the binding from =Super= to =Meta= though
     #+begin_src emacs-lisp
       (use-package windmove
          :init (progn
                  (windmove-default-keybindings 'meta)))
     #+end_src

