mwestbom.html
<div id="outline-container-unnumbered-26" class="outline-4">
<h4 id="unnumbered-26">Backups</h4>
<div class="outline-text-4" id="text-unnumbered-26">
<p>
Turn on a whole mess of backup/save stuff. I'll probably cut
this out eventually.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq
 backup-by-copying t
 backup-directory-alist '<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"."</span> . <span class="org-string">"~/.emacs.d/saves"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
 delete-old-versions -1
 version-control t<span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">let</span>
    <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span>autosave-dir <span class="org-rainbow-delimiters-depth-4">(</span>expand-file-name <span class="org-string">"autosave"</span> user-emacs-directory<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">unless</span> <span class="org-rainbow-delimiters-depth-3">(</span>file-exists-p autosave-dir<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>make-directory autosave-dir<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>setq auto-save-list-file-prefix <span class="org-rainbow-delimiters-depth-3">(</span>concat autosave-dir <span class="org-string">"/"</span><span class="org-rainbow-delimiters-depth-3">)</span>
        auto-save-file-name-transforms `<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span><span class="org-string">".*"</span> ,autosave-dir t<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>setq gc-cons-threshold 200000000<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-27" class="outline-4">
<h4 id="unnumbered-27">Modeline</h4>
<div class="outline-text-4" id="text-unnumbered-27">
<p>
The default modeline can get unwieldy, and go wider than the frame.
</p>

<p>
Add Bruce Connor's <a href="https://github.com/Bruce-Connor/smart-mode-line">smart-mode-line</a> to make for a prettier and more
manageable modeline
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">smart-mode-line</span>
  <span class="org-builtin">:ensure</span> smart-mode-line
  <span class="org-builtin">:pre-init</span>
  <span class="org-builtin">:init</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">use-package</span> <span class="org-constant">smart-mode-line-powerline-theme</span>
      <span class="org-builtin">:ensure</span> smart-mode-line-powerline-theme<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:config</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>setq-default mode-line-format
                  '<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-string">"%e"</span>
                    mode-line-front-space
                    mode-line-mule-info
                    mode-line-client
                    mode-line-modified
                    mode-line-remote
                    mode-line-frame-identification
                    mode-line-buffer-identification
                    sml/pos-id-separator
                    mode-line-position
                    <span class="org-rainbow-delimiters-depth-5">(</span>vc-mode vc-mode<span class="org-rainbow-delimiters-depth-5">)</span>
                    sml/pre-modes-separator
                    mode-line-modes
                    mode-line-misc-info
                    mode-line-end-spaces<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>sml/setup<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-28" class="outline-4">
<h4 id="unnumbered-28">Undo Tree</h4>
<div class="outline-text-4" id="text-unnumbered-28">
<p>
Undo tree is fabulous
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">undo-tree</span>
  <span class="org-builtin">:ensure</span> undo-tree
  <span class="org-builtin">:diminish</span> undo-tree-mode
  <span class="org-builtin">:init</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>global-undo-tree-mode<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-29" class="outline-4">
<h4 id="unnumbered-29">Window management</h4>
<div class="outline-text-4" id="text-unnumbered-29">
</div><div id="outline-container-unnumbered-30" class="outline-5">
<h5 id="unnumbered-30">Window splitting</h5>
<div class="outline-text-5" id="text-unnumbered-30">
<p>
Stole these from
<a href="http://pages.sachachua.com/.emacs.d/Sacha.html#unnumbered-28">Sacha Chua</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">vsplit-last-buffer</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>interactive<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>split-window-vertically<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>other-window 1 nil<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>switch-to-next-buffer<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">hsplit-last-buffer</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>interactive<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>split-window-horizontally<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>other-window 1 nil<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>switch-to-next-buffer<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-x 2"</span><span class="org-rainbow-delimiters-depth-2">)</span> 'vsplit-last-buffer<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-x 3"</span><span class="org-rainbow-delimiters-depth-2">)</span> 'hsplit-last-buffer<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-31" class="outline-5">
<h5 id="unnumbered-31">Winner mode</h5>
<div class="outline-text-5" id="text-unnumbered-31">
<p>
Winner mode adds an undo history to window configurations.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">winner</span>
  <span class="org-builtin">:ensure</span> winner
  <span class="org-builtin">:init</span> <span class="org-rainbow-delimiters-depth-2">(</span>winner-mode 1<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-unnumbered-32" class="outline-3">
<h3 id="unnumbered-32">Navigation</h3>
<div class="outline-text-3" id="text-unnumbered-32">
</div><div id="outline-container-unnumbered-33" class="outline-4">
<h4 id="unnumbered-33">The Silver Searcher</h4>
<div class="outline-text-4" id="text-unnumbered-33">
<p>
Enable integration with Ag.  This must happen before <a href="#unnumbered-39">Projectile</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">helm-ag</span>
  <span class="org-builtin">:ensure</span> helm-ag<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-34" class="outline-4">
<h4 id="unnumbered-34">Windmove</h4>
<div class="outline-text-4" id="text-unnumbered-34">
<p>
Windmove beats using <code>C-x o</code> to toggle through windows
</p>

<p>
Let's switch the binding from <code>Super</code> to <code>Meta</code> though
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">windmove</span>
   <span class="org-builtin">:init</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
           <span class="org-rainbow-delimiters-depth-3">(</span>windmove-default-keybindings 'meta<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
