mwestbom.org
*** Beginning of line
    Instead of =C-a= moving to column 0, go to first non-whitespace
    character.  THEN go to column 0.  And back again.
    #+BEGIN_SRC emacs-lisp
      (defun smarter-move-beginning-of-line (arg)
        "Move point back to indentation of beginning of line.

      Move point to the first non-whitespace character on this line.
      If point is already there, move to beginning of the line.
      Effectively toggle between the first non-whitespace character and
      the beginning of the line.

      If ARG is not nil or 1, move forward ARG - 1 lines first.
      If point reaches the beginning or end of the buffer, stop there."
        (interactive "^p")
        (setq arg (or arg 1))

        ;; Move lines first
        (when (/= arg 1)
          (let ((line-move-visual nil))
            (forward (1- arg))))

        (let ((orig-point (point)))
          (back-to-indentation)
          (when (= orig-point (point))
            (move-beginning-of-line 1))))

      ;; remap C-a to `smarter-move-beginning-of-line`
      (global-set-key [remap move-beginning-of-line]
                      'smarter-move-beginning-of-line)

    #+END_SRC
*** Visual expand
    Experiment with keybindings for visual expand
    #+BEGIN_SRC emacs-lisp
      (use-package expand-region
        :ensure expand-region
        :bind ("C-=" . er/expand-region))
    #+END_SRC
*** Pop to mark
    Haven't built this into muscle memory yet.
    #+begin_src emacs-lisp
      (bind-key "C-x p" 'pop-to-mark-command)
      (setq set-mark-command-repeat-pop t)
    #+end_src

*** Switch to previous buffer
    Switch to last buffer. Absolutely essential.
    #+begin_src emacs-lisp
      (defun mcw/switch-to-previous-buffer ()
        "Switch to previously open buffer.
      Repeated invocations toggle between the most recently open buffers."
        (interactive)
        (switch-to-buffer (other-buffer (current-buffer) 1)))

      (bind-key "C-c b" 'mcw/switch-to-previous-buffer)
    #+end_src
*** Projectile
    [[https://github.com/bbatsov/projectile][Projectile]] is a fantastic tool.
    #+BEGIN_SRC emacs-lisp
      (use-package projectile
        :ensure projectile
        :diminish projectile-mode
        :init
        (progn
          (setq projectile-keymap-prefix (kbd "C-c p"))
          (projectile-global-mode)))
    #+END_SRC

    Also enable helm-projectile, which teaches projectile to use helm.
    #+BEGIN_SRC emacs-lisp
      (use-package helm-projectile
        :ensure helm-projectile
        :config
        (helm-projectile-on))
    #+END_SRC
** Org
*** Literate programming
    Just use the same window for the source buffer.
    #+BEGIN_SRC emacs-lisp
      (setq org-src-window-setup 'current-window)
    #+END_SRC
*** Speed keys
    #+BEGIN_SRC emacs-lisp
      (setq org-use-speed-commands t)
    #+END_SRC

*** Publishing
**** Section numbers
     Don't bother adding section numbers.
     #+BEGIN_SRC emacs-lisp
       (setq org-export-with-section-numbers nil)
       (setq org-html-include-timestamps nil)
       (setq org-export-with-sub-superscripts nil)
     #+END_SRC
**** Stylesheets
     How to style stuffs for export purposes
     #+BEGIN_SRC emacs-lisp
       (defun mcw/get-org-htmlize-css-string ()
         "Get CSS from org-html-htmlize-generate-css buffer"
         (save-current-buffer
           (org-html-htmlize-generate-css)
           (let ((css-tag (buffer-string)))
             (kill-buffer)
             css-tag)))

       (setq org-html-htmlize-output-type 'css)
       (setq org-src-fontify-natively t)
     #+END_SRC
