mwestbom.html

<div id="outline-container-unnumbered-35" class="outline-4">
<h4 id="unnumbered-35">Beginning of line</h4>
<div class="outline-text-4" id="text-unnumbered-35">
<p>
Instead of <code>C-a</code> moving to column 0, go to first non-whitespace
character.  THEN go to column 0.  And back again.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">smarter-move-beginning-of-line</span> <span class="org-rainbow-delimiters-depth-2">(</span>arg<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Move point back to indentation of beginning of line.</span>

<span class="org-doc">Move point to the first non-whitespace character on this line.</span>
<span class="org-doc">If point is already there, move to beginning of the line.</span>
<span class="org-doc">Effectively toggle between the first non-whitespace character and</span>
<span class="org-doc">the beginning of the line.</span>

<span class="org-doc">If ARG is not nil or 1, move forward ARG - 1 lines first.</span>
<span class="org-doc">If point reaches the beginning or end of the buffer, stop there."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>interactive <span class="org-string">"^p"</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>setq arg <span class="org-rainbow-delimiters-depth-3">(</span>or arg 1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Move lines first</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">when</span> <span class="org-rainbow-delimiters-depth-3">(</span>/= arg 1<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-rainbow-delimiters-depth-5">(</span>line-move-visual nil<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>forward <span class="org-rainbow-delimiters-depth-5">(</span>1- arg<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>

  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span>orig-point <span class="org-rainbow-delimiters-depth-5">(</span>point<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>back-to-indentation<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">when</span> <span class="org-rainbow-delimiters-depth-4">(</span>= orig-point <span class="org-rainbow-delimiters-depth-5">(</span>point<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>move-beginning-of-line 1<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">remap C-a to `smarter-move-beginning-of-line`</span>
<span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">[</span>remap move-beginning-of-line<span class="org-rainbow-delimiters-depth-2">]</span>
                'smarter-move-beginning-of-line<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-36" class="outline-4">
<h4 id="unnumbered-36">Visual expand</h4>
<div class="outline-text-4" id="text-unnumbered-36">
<p>
Experiment with keybindings for visual expand
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">expand-region</span>
  <span class="org-builtin">:ensure</span> expand-region
  <span class="org-builtin">:bind</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"C-="</span> . er/expand-region<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-37" class="outline-4">
<h4 id="unnumbered-37">Pop to mark</h4>
<div class="outline-text-4" id="text-unnumbered-37">
<p>
Haven't built this into muscle memory yet.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>bind-key <span class="org-string">"C-x p"</span> 'pop-to-mark-command<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>setq set-mark-command-repeat-pop t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-38" class="outline-4">
<h4 id="unnumbered-38">Switch to previous buffer</h4>
<div class="outline-text-4" id="text-unnumbered-38">
<p>
Switch to last buffer. Absolutely essential.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">mcw/switch-to-previous-buffer</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"Switch to previously open buffer.</span>
<span class="org-doc">Repeated invocations toggle between the most recently open buffers."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>interactive<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>switch-to-buffer <span class="org-rainbow-delimiters-depth-3">(</span>other-buffer <span class="org-rainbow-delimiters-depth-4">(</span>current-buffer<span class="org-rainbow-delimiters-depth-4">)</span> 1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>bind-key <span class="org-string">"C-c b"</span> 'mcw/switch-to-previous-buffer<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-39" class="outline-4">
<h4 id="unnumbered-39">Projectile</h4>
<div class="outline-text-4" id="text-unnumbered-39">
<p>
<a href="https://github.com/bbatsov/projectile">Projectile</a> is a fantastic tool.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">projectile</span>
  <span class="org-builtin">:ensure</span> projectile
  <span class="org-builtin">:diminish</span> projectile-mode
  <span class="org-builtin">:init</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>setq projectile-keymap-prefix <span class="org-rainbow-delimiters-depth-4">(</span>kbd <span class="org-string">"C-c p"</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>projectile-global-mode<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Also enable helm-projectile, which teaches projectile to use helm.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">helm-projectile</span>
  <span class="org-builtin">:ensure</span> helm-projectile
  <span class="org-builtin">:config</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>helm-projectile-on<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-unnumbered-40" class="outline-3">
<h3 id="unnumbered-40">Org</h3>
<div class="outline-text-3" id="text-unnumbered-40">
</div><div id="outline-container-unnumbered-41" class="outline-4">
<h4 id="unnumbered-41">Speed keys</h4>
<div class="outline-text-4" id="text-unnumbered-41">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq org-use-speed-commands t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-42" class="outline-4">
<h4 id="unnumbered-42">Publishing</h4>
<div class="outline-text-4" id="text-unnumbered-42">
</div><div id="outline-container-unnumbered-43" class="outline-5">
<h5 id="unnumbered-43">Section numbers</h5>
<div class="outline-text-5" id="text-unnumbered-43">
<p>
Don't bother adding section numbers.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq org-export-with-section-numbers nil<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>setq org-html-include-timestamps nil<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>setq org-export-with-sub-superscripts nil<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-44" class="outline-5">
<h5 id="unnumbered-44">Stylesheets</h5>
<div class="outline-text-5" id="text-unnumbered-44">
<p>
How to style stuffs for export purposes
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">mcw/get-org-htmlize-css-string</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"Get CSS from org-html-htmlize-generate-css buffer"</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">save-current-buffer</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>org-html-htmlize-generate-css<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-rainbow-delimiters-depth-5">(</span>css-tag <span class="org-rainbow-delimiters-depth-6">(</span>buffer-string<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>kill-buffer<span class="org-rainbow-delimiters-depth-4">)</span>
      css-tag<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>setq org-html-htmlize-output-type 'css<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>setq org-src-fontify-natively t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
