mwestbom.org
**** Publish config file
     Publish my config file.
     #+BEGIN_SRC emacs-lisp
       (defun mcw/org-share-emacs ()
         "Publish emacs config"
         (interactive)
         (setq org-html-doctype "html5")
         (setq org-html-html5-fancy t)
         (with-current-buffer (find-file "~/.emacs.d/mwestbom.org")
           (save-restriction
             (save-excursion
               (widen)
               (remove-hook 'prog-mode-hook 'rainbow-identifiers-mode)
               (org-html-export-to-html)
               (add-hook 'prog-mode-hook 'rainbow-identifiers-mode)))))
     #+END_SRC
** Programming
*** Git
    Emacs has so many fantastic get-related tools.
**** Magit
     Magit is 90% of why I moved over to it in the first place.
     #+BEGIN_SRC emacs-lisp
       (use-package magit
         :commands magit-status
         :load-path "site-lisp/magit"
         :init (progn
                 (use-package dash
                   :ensure t)
                 (bind-key "C-x g" 'magit-status))
         :config
         (progn
           (setq magit-diff-options '("-b"))))
     #+END_SRC

**** Gist
     Here's a handy tool for working with gists.  I don't use it very often, but I enjoy it when I do.
     #+BEGIN_SRC emacs-lisp
       (use-package gist
         :ensure gist
         :commands (gist-buffer gist-region gist-list))
     #+END_SRC

**** git-timemachine
     Lets you flip back and forth through a file's VC history
     #+BEGIN_SRC emacs-lisp
       (use-package git-timemachine
         :ensure git-timemachine)
     #+END_SRC
**** git-messenger
     Shows most recent commit message for line under mark
     #+BEGIN_SRC emacs-lisp
       (use-package git-messenger
         :ensure t
         :bind (("C-x v p" . git-messenger:popup-message)))
     #+END_SRC
*** Rainbows!
**** Rainbow identifiers
     Lots and lots of colors...
     #+BEGIN_SRC emacs-lisp
       (use-package rainbow-identifiers
         :ensure rainbow-delimiters
         :config (progn
                   (add-hook 'prog-mode-hook 'rainbow-identifiers-mode)))
     #+END_SRC

**** Rainbow Delimiters
     Individually color delimiters, to differentiate levels of nesting.
     #+BEGIN_SRC emacs-lisp
       (use-package rainbow-delimiters
         :ensure rainbow-delimiters
         :config (progn
                   (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)))
     #+END_SRC
*** Yasnippet
    Loads and loads of useful snippets.  The ability to add more snippets
    #+BEGIN_SRC emacs-lisp
      (use-package yasnippet
        :ensure yasnippet
        :init
        (progn
          (add-to-list 'yas-snippet-dirs "site-lisp/yasnippet-snippets")
          (yas-global-mode 1)))
    #+END_SRC
*** Autocomplete
    Bring in company mode for autocomplete
    #+BEGIN_SRC emacs-lisp
      (use-package company
        :ensure company
        :diminish company-mode
        :config
        (add-hook 'prog-mode-hook 'company-mode))
    #+END_SRC
*** Flycheck
    Enables support for linting in a bunch of different languages.
    #+BEGIN_SRC emacs-lisp
      (use-package flycheck
        :ensure t
        :diminish flycheck-mode
        :init
        (global-flycheck-mode))
    #+END_SRC
*** Smartparens
    Enable automatic matching of paired syntax tokens.  This is brilliant.
    #+BEGIN_SRC emacs-lisp
      (defun mcw/web-mode-is-code-context (id action context)
        (when (and (eq action 'insert)
                   (not (or (get-text-property (point) 'part-side)
                            (get-text-property (point) 'block-side))))
          t))


      (use-package smartparens
        :ensure smartparens
        :diminish smartparens-mode
        :config
        (progn
          (require 'smartparens-config)
          (sp-local-pair 'web-mode "<" nil :when '(sp-web-mode-is-code-context))
          (smartparens-global-strict-mode)
          (smartparens-global-mode 1)))
    #+END_SRC
