mwestbom.html
<div id="outline-container-unnumbered-45" class="outline-5">
<h5 id="unnumbered-45">Publish config file</h5>
<div class="outline-text-5" id="text-unnumbered-45">
<p>
Publish my config file.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">mcw/org-share-emacs</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"Publish emacs config"</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>interactive<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>setq org-html-doctype <span class="org-string">"html5"</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>setq org-html-html5-fancy t<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">with-current-buffer</span> <span class="org-rainbow-delimiters-depth-3">(</span>find-file <span class="org-string">"~/.emacs.d/mwestbom.org"</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">save-restriction</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">save-excursion</span>
        <span class="org-rainbow-delimiters-depth-5">(</span>widen<span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-5">(</span>remove-hook 'prog-mode-hook 'rainbow-identifiers-mode<span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-5">(</span>org-html-export-to-html<span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-5">(</span>add-hook 'prog-mode-hook 'rainbow-identifiers-mode<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-unnumbered-46" class="outline-3">
<h3 id="unnumbered-46">Programming</h3>
<div class="outline-text-3" id="text-unnumbered-46">
</div><div id="outline-container-unnumbered-47" class="outline-4">
<h4 id="unnumbered-47">Git</h4>
<div class="outline-text-4" id="text-unnumbered-47">
<p>
Emacs has so many fantastic get-related tools.
</p>
</div>
<div id="outline-container-unnumbered-48" class="outline-5">
<h5 id="unnumbered-48">Magit</h5>
<div class="outline-text-5" id="text-unnumbered-48">
<p>
Magit is 90% of why I moved over to it in the first place.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">magit</span>
  <span class="org-builtin">:commands</span> magit-status
  <span class="org-builtin">:load-path</span> <span class="org-string">"site-lisp/magit"</span>
  <span class="org-builtin">:init</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
          <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">use-package</span> <span class="org-constant">dash</span>
            <span class="org-builtin">:ensure</span> t<span class="org-rainbow-delimiters-depth-3">)</span>
          <span class="org-rainbow-delimiters-depth-3">(</span>bind-key <span class="org-string">"C-x g"</span> 'magit-status<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:config</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>setq magit-diff-options '<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-string">"-b"</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-49" class="outline-5">
<h5 id="unnumbered-49">Gist</h5>
<div class="outline-text-5" id="text-unnumbered-49">
<p>
Here's a handy tool for working with gists.  I don't use it very often, but I enjoy it when I do.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">gist</span>
  <span class="org-builtin">:ensure</span> gist
  <span class="org-builtin">:commands</span> <span class="org-rainbow-delimiters-depth-2">(</span>gist-buffer gist-region gist-list<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-50" class="outline-5">
<h5 id="unnumbered-50">git-timemachine</h5>
<div class="outline-text-5" id="text-unnumbered-50">
<p>
Lets you flip back and forth through a file's VC history
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">git-timemachine</span>
  <span class="org-builtin">:ensure</span> git-timemachine<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-51" class="outline-5">
<h5 id="unnumbered-51">git-messenger</h5>
<div class="outline-text-5" id="text-unnumbered-51">
<p>
Shows most recent commit message for line under mark
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">git-messenger</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:bind</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"C-x v p"</span> . git-messenger:popup-message<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-unnumbered-52" class="outline-4">
<h4 id="unnumbered-52">Rainbows!</h4>
<div class="outline-text-4" id="text-unnumbered-52">
</div><div id="outline-container-unnumbered-53" class="outline-5">
<h5 id="unnumbered-53">Rainbow identifiers</h5>
<div class="outline-text-5" id="text-unnumbered-53">
<p>
Lots and lots of colors&#x2026;
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">rainbow-identifiers</span>
  <span class="org-builtin">:ensure</span> rainbow-delimiters
  <span class="org-builtin">:config</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
            <span class="org-rainbow-delimiters-depth-3">(</span>add-hook 'prog-mode-hook 'rainbow-identifiers-mode<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-54" class="outline-5">
<h5 id="unnumbered-54">Rainbow Delimiters</h5>
<div class="outline-text-5" id="text-unnumbered-54">
<p>
Individually color delimiters, to differentiate levels of nesting.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">rainbow-delimiters</span>
  <span class="org-builtin">:ensure</span> rainbow-delimiters
  <span class="org-builtin">:config</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
            <span class="org-rainbow-delimiters-depth-3">(</span>add-hook 'prog-mode-hook 'rainbow-delimiters-mode<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-unnumbered-55" class="outline-4">
<h4 id="unnumbered-55">Autocomplete</h4>
<div class="outline-text-4" id="text-unnumbered-55">
<p>
Bring in company mode for autocomplete
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">company</span>
  <span class="org-builtin">:ensure</span> company
  <span class="org-builtin">:diminish</span> company-mode
  <span class="org-builtin">:config</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>add-hook 'prog-mode-hook 'company-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-56" class="outline-4">
<h4 id="unnumbered-56">Flycheck</h4>
<div class="outline-text-4" id="text-unnumbered-56">
<p>
Enables support for linting in a bunch of different languages.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">flycheck</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span> flycheck-mode
  <span class="org-builtin">:init</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>global-flycheck-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-57" class="outline-4">
<h4 id="unnumbered-57">Smartparens</h4>
<div class="outline-text-4" id="text-unnumbered-57">
<p>
Enable automatic matching of paired syntax tokens.  This is brilliant.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">smartparens</span>
  <span class="org-builtin">:ensure</span> smartparens
  <span class="org-builtin">:diminish</span> smartparens-mode
  <span class="org-builtin">:config</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">require</span> '<span class="org-constant">smartparens-config</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>smartparens-global-mode 1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
