mwestbom.org
*** Web mode
    Web mode is pretty great about handling mixed-mode files like
    HTML pages with javascript, or handlebars template pages.

    Enable it for handlebars files.
    #+BEGIN_SRC emacs-lisp
      ;; From faq at http://web-mode.org/ for smartparens
      (defun mcw/web-mode-hook ()
        (setq web-mode-enable-auto-pairing nil))

      (use-package web-mode
        :ensure t
        :mode ("\\.hbs\\'" . web-mode)
        :init
        (progn
          (add-hook 'web-mode-hook 'mcw/web-mode-hook)))
    #+END_SRC
*** Clojure
**** Clojure mode
     #+BEGIN_SRC emacs-lisp
       (use-package clojure-mode
         :commands clojure-mode
         :mode (("\\.clj\\'" . clojure-mode)
                ("\\.cljs\\'" . clojure-mode)))
     #+END_SRC
**** Cider
     #+BEGIN_SRC emacs-lisp
       (use-package cider
         :ensure cider
         :commands cider-jack-in
         :bind ("C-c M-j" . cider-jack-in))
     #+END_SRC
*** Various language modes
**** Ruby
***** enh-ruby-mode
      Replace standard ruby mode with enh-ruby-mode.  I like its indentation engine better.
      #+BEGIN_SRC emacs-lisp
        (use-package enh-ruby-mode
          :ensure t
          :diminish enh-ruby-mode
          :commands enh-ruby-mode
          :init
          (progn
            (add-to-list 'auto-mode-alist '("\\.rb$" . enh-ruby-mode))
            (add-to-list 'interpreter-mode-alist '("ruby" . enh-ruby-mode))))
      #+END_SRC

***** rspec mode
      Run rspec from emacs.  I love this so much.

      Overwrite the default predicate method for rspec mode, because it doesn't play
      nicely with rbenv
      #+BEGIN_SRC emacs-lisp
        (use-package rspec-mode
          :ensure rspec-mode
          :diminish rspec-mode
          :commands rspec-mode
          :init
          (progn
            (add-hook 'enh-ruby-mode-hook 'rspec-mode))
          :config
          (progn
            (setq rspec-command-options "--fail-fast --format documentation")
            (defun rspec-spring-p ()
              (and rspec-use-spring-when-possible
                   (let ((root (directory-file-name (rspec-project-root))))
                     (or
                      (file-exists-p (format "%s/tmp/spring/spring.pid" root))
                      (file-exists-p (format "%s/spring/%s.pid" temporary-file-directory (md5 root)))
                      (let ((path (or (getenv "XDG_RUNTIME_DIR") temporary-file-directory))
                            (ruby-version (getenv "RBENV_VERSION")))
                        (file-exists-p (format "%s/spring/%s.pid" path (md5 (concat ruby-version root)))))))))
            (inf-ruby-switch-setup)))
      #+END_SRC

***** rbenv
      #+BEGIN_SRC emacs-lisp
        (use-package rbenv
          :ensure t
          :commands rbenv-use-global
          :init
          (progn
            (add-hook 'enh-ruby-mode-hook 'rbenv-use-global)))
      #+END_SRC
***** projectile-rails
      Add projectile rails for rails-specific completions, finders, commands
      #+BEGIN_SRC emacs-lisp
        (use-package projectile-rails
          :ensure projectile-rails
          :commands projectile-rails-on
          :init
          (add-hook 'projectile-mode-hook 'projectile-rails-on))
      #+END_SRC
**** Markdown
    Enable markdown mode
    #+BEGIN_SRC emacs-lisp
      (use-package markdown-mode
        :ensure t
        :mode ("\\.md\\'" . markdown-mode))
    #+END_SRC
**** Docker
    #+BEGIN_SRC emacs-lisp
      (use-package dockerfile-mode
        :ensure t
        :mode ("Dockerfile\\'" . dockerfile-mode))
    #+END_SRC
**** Javascript
     js2-mode seems to have the best indentation/linting support.
     #+BEGIN_SRC emacs-lisp
       (use-package js2-mode
         :commands js2-mode
         :ensure t
         :init
         (progn
           (add-to-list 'auto-mode-alist '("\\.js$" . js2-mode))
           (add-to-list 'interpreter-mode-alist (cons "node" 'js2-mode))))
     #+END_SRC
**** CSS
***** Less
      #+BEGIN_SRC emacs-lisp
        (use-package less-css-mode
          :commands less-css-mode
          :ensure less-css-mode
          :mode ("\\.less\\'" . less-css-mode))
      #+END_SRC
**** Yaml
     #+BEGIN_SRC emacs-lisp
       (use-package yaml-mode
         :ensure yaml-mode
         :mode "\\.yml\\'")
     #+END_SRC
** Terminals and shells
