mwestbom.html
<div id="outline-container-unnumbered-58" class="outline-4">
<h4 id="unnumbered-58">Web mode</h4>
<div class="outline-text-4" id="text-unnumbered-58">
<p>
Web mode is pretty great about handling mixed-mode files like
HTML pages with javascript, or handlebars template pages.
</p>

<p>
Enable it for handlebars files.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">web-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"\\.hbs\\'"</span> . web-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-59" class="outline-4">
<h4 id="unnumbered-59">Clojure</h4>
<div class="outline-text-4" id="text-unnumbered-59">
</div><div id="outline-container-unnumbered-60" class="outline-5">
<h5 id="unnumbered-60">Clojure mode</h5>
<div class="outline-text-5" id="text-unnumbered-60">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">clojure-mode</span>
  <span class="org-builtin">:commands</span> clojure-mode
  <span class="org-builtin">:mode</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"\\.clj\\'"</span> . clojure-mode<span class="org-rainbow-delimiters-depth-3">)</span>
         <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"\\.cljs\\'"</span> . clojure-mode<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-61" class="outline-5">
<h5 id="unnumbered-61">Cider</h5>
<div class="outline-text-5" id="text-unnumbered-61">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">cider</span>
  <span class="org-builtin">:ensure</span> cider
  <span class="org-builtin">:commands</span> cider-jack-in
  <span class="org-builtin">:bind</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"C-c M-j"</span> . cider-jack-in<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-unnumbered-62" class="outline-4">
<h4 id="unnumbered-62">Various language modes</h4>
<div class="outline-text-4" id="text-unnumbered-62">
</div><div id="outline-container-unnumbered-63" class="outline-5">
<h5 id="unnumbered-63">Ruby</h5>
<div class="outline-text-5" id="text-unnumbered-63">
</div><ul class="org-ul"><li><a id="unnumbered-64"></a>enh-ruby-mode<br ><div class="outline-text-6" id="text-unnumbered-64">
<p>
Replace standard ruby mode with enh-ruby-mode.  I like its indentation engine better.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">enh-ruby-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span> enh-ruby-mode
  <span class="org-builtin">:commands</span> enh-ruby-mode
  <span class="org-builtin">:init</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>add-to-list 'auto-mode-alist '<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-string">"\\.rb$"</span> . enh-ruby-mode<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>add-to-list 'interpreter-mode-alist '<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-string">"ruby"</span> . enh-ruby-mode<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>

<li><a id="unnumbered-65"></a>rspec mode<br ><div class="outline-text-6" id="text-unnumbered-65">
<p>
Run rspec from emacs.  I love this so much.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">rspec-mode</span>
  <span class="org-builtin">:ensure</span> rspec-mode
  <span class="org-builtin">:diminish</span> rspec-mode
  <span class="org-builtin">:commands</span> rspec-mode
  <span class="org-builtin">:init</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>add-hook 'enh-ruby-mode-hook 'rspec-mode<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:config</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>setq rspec-command-options <span class="org-string">"--fail-fast --format documentation"</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>inf-ruby-switch-setup<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>

<li><a id="unnumbered-66"></a>rbenv<br ><div class="outline-text-6" id="text-unnumbered-66">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">rbenv</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:commands</span> rbenv-use-global
  <span class="org-builtin">:init</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>add-hook 'enh-ruby-mode-hook 'rbenv-use-global<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li></ul>
</div>
<div id="outline-container-unnumbered-67" class="outline-5">
<h5 id="unnumbered-67">Markdown</h5>
<div class="outline-text-5" id="text-unnumbered-67">
<p>
Enable markdown mode
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">markdown-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"\\.md\\'"</span> . markdown-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-68" class="outline-5">
<h5 id="unnumbered-68">Docker</h5>
<div class="outline-text-5" id="text-unnumbered-68">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">dockerfile-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"Dockerfile\\'"</span> . dockerfile-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-69" class="outline-5">
<h5 id="unnumbered-69">Javascript</h5>
<div class="outline-text-5" id="text-unnumbered-69">
<p>
js2-mode seems to have the best indentation/linting support.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">js2-mode</span>
  <span class="org-builtin">:commands</span> js2-mode
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:init</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>add-to-list 'auto-mode-alist '<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-string">"\\.js$"</span> . js2-mode<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>add-to-list 'interpreter-mode-alist <span class="org-rainbow-delimiters-depth-4">(</span>cons <span class="org-string">"node"</span> 'js2-mode<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-70" class="outline-5">
<h5 id="unnumbered-70">CSS</h5>
<div class="outline-text-5" id="text-unnumbered-70">
</div><ul class="org-ul"><li><a id="unnumbered-71"></a>Less<br ><div class="outline-text-6" id="text-unnumbered-71">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">less-css-mode</span>
  <span class="org-builtin">:commands</span> less-css-mode
  <span class="org-builtin">:ensure</span> less-css-mode
  <span class="org-builtin">:mode</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"\\.less\\'"</span> . less-css-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li></ul>
</div>
<div id="outline-container-unnumbered-72" class="outline-5">
<h5 id="unnumbered-72">Yaml</h5>
<div class="outline-text-5" id="text-unnumbered-72">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">yaml-mode</span>
  <span class="org-builtin">:ensure</span> yaml-mode
  <span class="org-builtin">:mode</span> <span class="org-string">"\\.yml\\'"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-unnumbered-73" class="outline-3">
<h3 id="unnumbered-73">Terminals and shells</h3>
